In [29]:
import pandas as pd

cardata = { "Mercedes": [2, 4, 0, 4, 0, 3], "Ford": [3, 0, 0, 1, 6, 12], "Tata":[9, 3, 4, 1, 0, 0], "Renault":[12, 1, 0, 0, 3, 1]}
carsales = pd.DataFrame(cardata)
carsales.index.rename("Sales place", inplace=True)
carsales.rename(index={0: "One", 1: "Two", 2: "Three", 3: "Four", 4: "Five", 5: "Six"}, inplace=True)

carsales

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
Five                0     6     0        3
Six                 3    12     0        1

# `.loc` function

- Select all salespaces where at least one Mercedes has been sold

In [28]:
carsales.Mercedes > 0

Sales place
One       True
Two       True
Three    False
Four      True
Five     False
Six       True
Name: Mercedes, dtype: bool

In [27]:
carsales.loc[carsales.Mercedes > 0]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Two                 4     0     3        1
Four                4     1     1        0
Six                 3    12     0        1

- Select all salespaces with at least one Mercedes and one Ford sold

In [26]:
carsales.loc[(carsales.Mercedes > 0) & (carsales.Ford > 0)]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Four                4     1     1        0
Six                 3    12     0        1

- Select rows conditional on the content of a list

In [25]:
salesPlaces = ["Two", "Three"]
selected = carsales.index.isin(salesPlaces)
carsales.loc[selected]

             Mercedes  Ford  Tata  Renault
Sales place
Two                 4     0     3        1
Three               0     0     4        0

- Select conditional on strings

In [24]:
fives = carsales.index.str.contains("Five")
carsales.loc[fives]

             Mercedes  Ford  Tata  Renault
Sales place
Five                0     6     0        3

- Make selection between values

In [22]:
print(carsales["Ford"].between(2, 20))

Sales place
One       True
Two      False
Three    False
Four     False
Five      True
Six       True
Name: Ford, dtype: bool

In [23]:
carsales.loc[carsales["Ford"].between(2, 20)]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Five                0     6     0        3
Six                 3    12     0        1

# `.iloc` function

- Select all salespaces where at least one Mercedes has been sold

In [30]:
list(carsales.Mercedes > 0)

[True, True, False, True, False, True]

In [31]:
mercList = list(carsales.Mercedes > 0)
carsales.iloc[mercList]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Two                 4     0     3        1
Four                4     1     1        0
Six                 3    12     0        1

In [32]:
carsales.iloc[list((carsales.Mercedes > 0) & (carsales.Ford > 0))]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Four                4     1     1        0
Six                 3    12     0        1